IDENTIFICATION DIVISION.
PROGRAM-ID. AppName.

PROCEDURE DIVISION.
    *> TODO => Replace logic
    DISPLAY "This is just a template.".
    STOP RUN WITH ERROR 1.

END PROGRAM AppName.
